#### Terraform Format 🖌 `success`
#### TFLint 🔍 `success`
#### Checkov Security 🛡️ `success`
#### Terraform Init ⚙️ `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
data.cloudflare_zone.io: Reading...
cloudflare_dns_record.com_dmarc: Refreshing state... [id=dd425603cec0e19b1976bdbf6130cf51]
cloudflare_dns_record.com_kube: Refreshing state... [id=e8ad8396e36c85e77213b4b11649a3c5]
cloudflare_zone_setting.io_min_tls_version: Refreshing state... [id=min_tls_version]
cloudflare_email_routing_settings.com: Refreshing state... [id=079a66a49aa90bf9799e6283d9c6e60c]
cloudflare_zone_setting.io_automatic_https_rewrites: Refreshing state... [id=automatic_https_rewrites]
cloudflare_zone_setting.io_always_use_https: Refreshing state... [id=always_use_https]
cloudflare_zone_setting.com_ssl: Refreshing state... [id=ssl]
cloudflare_zone_setting.com_always_use_https: Refreshing state... [id=always_use_https]
data.cloudflare_zone.io: Read complete after 0s [id=423c6a332e5079f6a5d32a24dc98291e]
cloudflare_zone_setting.io_brotli: Refreshing state... [id=brotli]
data.cloudflare_zone.com: Reading...
cloudflare_zone_setting.io_ssl: Refreshing state... [id=ssl]
cloudflare_zone_setting.io_tls_1_3: Refreshing state... [id=tls_1_3]
cloudflare_dns_record.io_dmarc: Refreshing state... [id=51d5dee04eb35f5ddceb4b1da32e93fa]
cloudflare_zone_setting.com_brotli: Refreshing state... [id=brotli]
cloudflare_dns_record.io_kube: Refreshing state... [id=f9f21480f4e1d51bb69438c020689cae]
cloudflare_zone_setting.com_tls_1_3: Refreshing state... [id=tls_1_3]
data.cloudflare_zone.com: Read complete after 0s [id=079a66a49aa90bf9799e6283d9c6e60c]
cloudflare_email_routing_settings.io: Refreshing state... [id=423c6a332e5079f6a5d32a24dc98291e]
cloudflare_zone_setting.com_security_level: Refreshing state... [id=security_level]
cloudflare_zone_setting.com_min_tls_version: Refreshing state... [id=min_tls_version]
cloudflare_zone_setting.com_automatic_https_rewrites: Refreshing state... [id=automatic_https_rewrites]
cloudflare_zone_setting.io_security_level: Refreshing state... [id=security_level]
cloudflare_email_routing_address.primary: Refreshing state... [id=30bd518646e848dc9ff23bf90d92b83c]
data.github_user.current: Reading...
github_actions_organization_permissions.this: Refreshing state... [id=signalstratum]
module.repo_talos_clusters.github_repository.this: Refreshing state... [id=talos-clusters]
data.github_organization.signalstratum: Reading...
module.repo_infrastructure.github_repository.this: Refreshing state... [id=infrastructure]
cloudflare_email_routing_dns.com: Refreshing state... [id=079a66a49aa90bf9799e6283d9c6e60c]
cloudflare_email_routing_dns.io: Refreshing state... [id=423c6a332e5079f6a5d32a24dc98291e]
cloudflare_email_routing_catch_all.com: Refreshing state... [id=079a66a49aa90bf9799e6283d9c6e60c]
cloudflare_email_routing_catch_all.io: Refreshing state... [id=423c6a332e5079f6a5d32a24dc98291e]
data.github_user.current: Read complete after 1s [id=128909040]
module.repo_infrastructure.github_branch_protection.main[0]: Refreshing state... [id=BPR_kwDOQuOit84EPOn_]
data.github_organization.signalstratum: Read complete after 2s [id=251301321]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.cloudflare_zero_trust_tunnel_cloudflared_token.virginia_talos will be read during apply
  # (config refers to values not yet known)
 <= data "cloudflare_zero_trust_tunnel_cloudflared_token" "virginia_talos" {
      + account_id = "c574042714913ce519ad59f95e0ff053"
      + token      = (known after apply)
      + tunnel_id  = (known after apply)
    }

  # cloudflare_zero_trust_tunnel_cloudflared.virginia_talos will be created
  + resource "cloudflare_zero_trust_tunnel_cloudflared" "virginia_talos" {
      + account_id        = "c574042714913ce519ad59f95e0ff053"
      + account_tag       = (known after apply)
      + config_src        = "local"
      + connections       = (known after apply)
      + conns_active_at   = (known after apply)
      + conns_inactive_at = (known after apply)
      + created_at        = (known after apply)
      + deleted_at        = (known after apply)
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "virginia-talos"
      + remote_config     = (known after apply)
      + status            = (known after apply)
      + tun_type          = (known after apply)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.virginia_talos will be created
  + resource "cloudflare_zero_trust_tunnel_cloudflared_config" "virginia_talos" {
      + account_id = "c574042714913ce519ad59f95e0ff053"
      + config     = {
          + ingress = [
              + {
                  + service = "http_status:404"
                },
            ]
        }
      + created_at = (known after apply)
      + id         = (known after apply)
      + source     = (known after apply)
      + tunnel_id  = (known after apply)
      + version    = (known after apply)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_route.virginia_private_network will be created
  + resource "cloudflare_zero_trust_tunnel_cloudflared_route" "virginia_private_network" {
      + account_id         = "c574042714913ce519ad59f95e0ff053"
      + comment            = "Hetzner Cloud private network - Virginia Talos cluster"
      + created_at         = (known after apply)
      + deleted_at         = (known after apply)
      + id                 = (known after apply)
      + network            = "10.0.0.0/16"
      + tunnel_id          = (known after apply)
      + virtual_network_id = (known after apply)
    }

  # module.onepassword_virginia_tunnel[0].onepassword_item.this will be created
  + resource "onepassword_item" "this" {
      + category   = "password"
      + id         = (known after apply)
      + note_value = (sensitive value)
      + password   = (sensitive value)
      + tags       = [
          + "terraform",
          + "cloudflare",
          + "virginia-talos",
          + "tunnel",
        ]
      + title      = "Cloudflare Tunnel - Virginia Talos"
      + url        = "https://one.dash.cloudflare.com/"
      + uuid       = (known after apply)
      + vault      = "ss-tf-managed"

      + section {
          + id    = (known after apply)
          + label = (sensitive value)

          + field {
              + id    = (known after apply)
              + label = (sensitive value)
              + type  = (sensitive value)
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = (sensitive value)
              + type  = (sensitive value)
              + value = (sensitive value)
            }
        }
    }

  # module.repo_talos_clusters.github_branch_protection.main[0] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOQu3R0Q"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "U_kgDOB67-8A",
            ]
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + contexts = [
              + "Terraform",
            ]
          + strict   = true
        }

      + restrict_pushes {
          + blocks_creations = true
          + push_allowances  = [
              + "U_kgDOB67-8A",
            ]
        }
    }

  # module.repo_talos_clusters.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ allow_auto_merge            = false -> true
        id                          = "talos-clusters"
        name                        = "talos-clusters"
      ~ visibility                  = "private" -> "public"
        # (38 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ repositories            = {
      ~ talos_clusters = {
            name          = "talos-clusters"
          ~ visibility    = "private" -> "public"
            # (4 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)
    }
  + virginia_tunnel_id      = (known after apply)
  + virginia_tunnel_token   = (sensitive value)

Warning: Resource Destruction Considerations

  with cloudflare_zero_trust_tunnel_cloudflared_config.virginia_talos,
  on cloudflare.tf line 36, in resource "cloudflare_zero_trust_tunnel_cloudflared_config" "virginia_talos":
  36: resource "cloudflare_zero_trust_tunnel_cloudflared_config" "virginia_talos" {

This resource cannot be destroyed from Terraform. If you create this
resource, it will be present in the API until manually deleted.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @JaredMichaelHawkins, Action: `pull_request`*